src/cf/DataProcessors/ЗагрузкаКотировокМТ5.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКотировокМТ5</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймфрейм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Таймфреймы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Котировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Таймфрейм</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Таймфреймы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Open</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Close</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>High</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Low</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Volume</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/Котировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Котировки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Open</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Close</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>High</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Low</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Таймфрейм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Таймфреймы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаКотировокМТ5/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 
    ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    
    ДиалогВыбораФайла.Каталог = Объект.ИмяФайла;
    ДиалогВыбораФайла.Заголовок = "Выберите каталог";
    
    ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ФайлНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;    
	
	Объект.ИмяФайла= ДиалогВыбораФайла.ПолноеИмяФайла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не задано имя файла!";
		Сообщение.Поле = "Объект.ИмяФайла";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Инструмент) Тогда
	  Сообщение = Новый СообщениеПользователю;
	  Сообщение.Текст = "Не выбран инструмент!";
	  Сообщение.Поле = "Объект.Инструмент";
	  Сообщение.УстановитьДанные(ЭтотОбъект);
	  Сообщение.Сообщить(); 
	  Возврат;
	КонецЕсли;
	
	Если  Не ЗначениеЗаполнено(Объект.Таймфрейм)Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен таймфрейм!";
		Сообщение.Поле = "Объект.Таймфрейм";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	   Возврат;
	КонецЕсли;
	
	
	Если  Не ПрочитатьФайлНаСервере() Тогда
		
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл!";
		//Сообщение.Поле = "";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция  ПрочитатьФайлНаСервере()
	Результат = Ложь;
	Объект.Котировки.Очистить();
	
	Чтение = Новый ЧтениеТекста();                                   
	Попытка
		
		Чтение.Открыть(Объект.ИмяФайла,КодировкаТекста.UTF8);
		
		Строка = Чтение.ПрочитатьСтроку();
		Строка = Чтение.ПрочитатьСтроку();
		
		
		Пока  Не Строка = Неопределено Цикл
			
			
			
			МассивЗначений = СтрРазделить(Строка,Символы.Таб,Ложь);
			
			НоваяСтрока = Объект.Котировки.Добавить();
			НоваяСтрока.Таймфрейм = Объект.Таймфрейм;
			НоваяСтрока.Инструмент = Объект.Инструмент;
			Если НЕ СтрНайти(МассивЗначений[1],":") Тогда
				
				НоваяСтрока.Период = Дата(ПеревернутьДату(МассивЗначений[0])+ " 00:00:00");
				НоваяСтрока.Open = МассивЗначений[1]; 
				НоваяСтрока.High = МассивЗначений[2];
				НоваяСтрока.Low = МассивЗначений[3];  
				НоваяСтрока.Close = МассивЗначений[4];  
				НоваяСтрока.Volume = МассивЗначений[6];	
			Иначе
				НоваяСтрока.Период = Дата(ПеревернутьДату(МассивЗначений[0]) +" "+ МассивЗначений[1]);
				НоваяСтрока.Open = МассивЗначений[2]; 
				НоваяСтрока.High = МассивЗначений[3];
				НоваяСтрока.Low = МассивЗначений[4];  
				НоваяСтрока.Close = МассивЗначений[5];  
				НоваяСтрока.Volume = МассивЗначений[7];		
			КонецЕсли;
			
						
		Строка = Чтение.ПрочитатьСтроку();	
			
		КонецЦикла;
		
		Результат = Истина;
	Исключение
	КонецПопытки;
	Возврат Результат;
КонецФункции// ()

Функция ПеревернутьДату(Дата)
         	//дд
Возврат Сред(Дата,9,2)+"."+Сред(Дата,6,2)+"."+Лев(Дата,4);	

КонецФункции // ()


&НаСервере
Процедура ЗагрузитьВБазуНаСервере()
	
	Для каждого Строка Из Объект.Котировки Цикл
		
		НЗ = РегистрыСведений.Котировки.СоздатьНаборЗаписей(); 
		НЗ.Отбор.Период.Установить(Строка.Период);
		НЗ.Отбор.Таймфрейм.Установить(Строка.Таймфрейм);
		НЗ.Отбор.Инструмент.Установить(Строка.Инструмент);
		
		НЗ.Прочитать();		
		Если НЕ НЗ.Количество() Тогда
			
			НоваяЗаписьНЗ = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗаписьНЗ,Строка);	
			НЗ.Записать(Ложь);    
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Запись " + Строка(Строка) + "Уже присутствует!";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВБазу(Команда)  
	Если НЕ Объект.Котировки.Количество() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет строк для загрузки!";
		Сообщение.Поле = "Объект.Котировки";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;	
		
		
	КонецЕсли;
	ЗагрузитьВБазуНаСервере();
КонецПроцедуры
